package happymagic.roleInfo.vo 
{
	/**
	 * ...
	 * @author lite3
	 */
	public class DismissChat 
	{
		public static const list:Array = [
									"哦，别解雇我，我会好好干的！",
									"出什么事了，是我不够努力吗？",
									"求求你了，主人。别解雇我，我会尽力的。",
									"为什么不要我了，我的能力没用吗？",
									"为什么要这样对待我，咱们再好好谈谈吧！",
									"怎么不要我了，谁会为你们杀敌呢？",
									"没有我的指点迷津，你的进步会慢得多！别解雇我。",
									"你将失去我的忠告，再考虑考虑吧！",
									"录用我的花费这么低，你又可以学习无穷的魔法和技能，为什么不要我了？",
									"不要我了，开玩笑吧！没有我，你的金币就少得多了！",
									"我不在谁为你报警呢？主人，你可犯了个大错误！",
									"我做了我应该做的，你还要解雇我，真不讲道理！",
									"将来你掉进陷井时候就会想起我的！",
									"跟着你挺有趣的，后会有期。",
									"哦，别解雇我，我会好好干的！",
									"记住，没有我你会失去一大笔钱。",
									"没有我，你就只能靠馊面包和凉水度日了?",  
									"啊，我知道，我对你已经没有用了。",
									"我们本来有协议的，你怎么能象丢垃圾一样把我扔在这儿呢？",
									"你不怕那些神奇的魔法了吗？我提醒过你了，好好想想吧！",
									"我已经向众神祈祷过了，他们说一旦你解雇我，他们会大发雷霆。",
									"好好考虑一下吧！",
									"你竟要解雇我这个鼓舞士气的指挥家？",
									"解雇我，在战斗中你可要倒霉的！",
									"既然我已没什么用了，好吧！",
									"请记住我为你效力的这段日子。",
									"啊，你忍心不要我这个可怜的老兵吗？请再考虑一下吧！",
									"哦，别解雇我，我会好好干的！",
									"我想你以后会后悔的！",
									"我为你拼命，还为你省钱，就得到这个结果？",
									"等等！听我说！我知道你并不想解雇我，我明白的！",
									"怎么回事？我可一直在努力啊！",
									"我不在，你将会失去了一个好朋友。",
									"你不会这样做的吧！",
									"哎~我的本事你才学了点皮毛。",
									"这么快就放弃了吗，小子？",
									"记住，你将失去我的忠告和渊博的知识！",
									"好吧，我可不会向别人乞求什么。",
									"要是你要解雇我，尽管这样做吧。"
									]
		
		
		public static function getRandomChat():String
		{
			return list[int(Math.random() * list.length)];
		}
	}

}